# BendingDetailTypeShowBarBendingUsing Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BendingDetailTypeShowBarBendingUsing Property
ParameterTypeId Class See Also
---
"Dimension Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BendingDetailTypeShowBarBendingUsing { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BendingDetailTypeShowBarBendingUsing As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BendingDetailTypeShowBarBendingUsing {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace